In [1]:
import pandas as pd
import numpy as np

### Connect Pandas to the database with this URL:

In [2]:
# sales1 = pd.read_csv('data/sales1.csv')
# sales1

In [3]:
# sales2 = pd.read_csv('data/sales2.csv')
# sales2

In [4]:
sales1_pth = '/home/vanderscycle/Documents/Lighthouse-lab/Databases/w2-d2-db/imdb_pandas/sales1.csv'

sales1= pd.read_csv(sales1_pth) # relative path use the forward slash
sales1.head()

                         Book title  Number sold  Sales price  Royalty paid
0            The Bricklayer’s Bible            8         2.99          0.55
1                          Swimrand            2         1.99          0.35
2  Pining For The Fisheries of Yore           28         2.99          0.55
3                The Duck Goes Here           34         2.99          0.55
4       The Tower Commission Report            4        11.50          4.25

In [5]:
sales1.shape[0]

5

In [6]:
sales1['currency_type'] = 'USD'
sales1.head()

,Book title,Number sold,Sales price,Royalty paid,currency_type
0,The Bricklayer’s Bible,8,2.99,0.55,USD
1,Swimrand,2,1.99,0.35,USD
2,Pining For The Fisheries of Yore,28,2.99,0.55,USD
3,The Duck Goes Here,34,2.99,0.55,USD
4,The Tower Commission Report,4,11.50,4.25,USD

In [7]:
sales1['Number sold']= sales1['Number sold'].astype('float64')

In [8]:
sales1.dtypes # need to change type of numbersold

Book title        object
Number sold      float64
Sales price      float64
Royalty paid     float64
currency_type     object
dtype: object

In [9]:
sales1.iloc[0]

Book title       The Bricklayer’s Bible
Number sold                           8
Sales price                        2.99
Royalty paid                       0.55
currency_type                       USD
Name: 0, dtype: object

In [10]:
sales2_pth = '/home/vanderscycle/Documents/Lighthouse-lab/Databases/w2-d2-db/imdb_pandas/sales2.csv'
sales2= pd.read_csv(sales2_pth) # relative path use the forward slash
sales2.head()

                              Title  Units sold  List price  Royalty
0                               NaN         NaN         NaN      NaN
1               Sales report for Q4         NaN         NaN      NaN
2            E-Book Reader US Store         NaN         NaN      NaN
3  Pining for the Fisheries of Yore        80.0        3.50    14.98
4                          Swimrand         1.0        2.99     0.14

In [11]:
sales2.iloc[[1],[3]]

   Royalty
1      NaN

In [12]:
sales2['currency_type'] =''

In [13]:
#First 9 rows are for USD, next 8 rows are for GBP and final 7 are for EUR
for row in range(len(sales2)):
    #print(row)
    if row < 9:
        #print("USD")
        sales2.iloc[[row],[4]] = 'USD'
        #print(sales2.iloc[row]['currency_type'])
    elif 9 <= row <17:
        #print("GBP")
        sales2.iloc[[row],[4]] = 'GBP'
    else:
        #print("EUR")
        sales2.iloc[[row],[4]] = 'EUR'
        #sales2.iloc[row]['currency_type'] = 'EUR'
sales2.head(20)

,Title,Units sold,List price,Royalty,currency_type
0,NaN,NaN,NaN,NaN,USD
1,Sales report for Q4,NaN,NaN,NaN,USD
2,E-Book Reader US Store,NaN,NaN,NaN,USD
3,Pining for the Fisheries of Yore,80.0,3.50,14.98,USD
4,Swimrand,1.0,2.99,0.14,USD
5,The Bricklayer's Bible,17.0,3.50,5.15,USD
6,The Duck Goes Here,34.0,2.99,5.78,USD
7,The Tower Commission Report,4.0,9.50,6.20,USD
8,US royalties (USD),NaN,NaN,32.25,USD
9,NaN,NaN,NaN,NaN,GBP
10,NaN,NaN,NaN,NaN,GBP
11,Sales report for Q4,NaN,NaN,NaN,GBP
12,E-Book Reader UK Store,NaN,NaN,NaN,GBP
13,Pining for the Fisheries of Yore,47.0,2.99,11.98,GBP
14,The Bricklayer's Bible,17.0,2.99,3.50,GBP
15,The Tower Commission Report,4.0,6.50,4.80,GBP
16,UK royalties (GBP),NaN,NaN,20.28,GBP
17,NaN,NaN,NaN,NaN,EUR
18,NaN,NaN,NaN,NaN,EUR
19,Sales report for Q4,NaN,NaN,NaN,EUR

In [14]:
sales2.dtypes

Title             object
Units sold       float64
List price       float64
Royalty          float64
currency_type     object
dtype: object

In [15]:
sales2.iloc[6]#['Title']

Title            The Duck Goes Here
Units sold                       34
List price                     2.99
Royalty                        5.78
currency_type                   USD
Name: 6, dtype: object

In [16]:
sales1[sales1['Book title'].isin(['The Duck Goes Here'])]

           Book title  Number sold  Sales price  Royalty paid currency_type
3  The Duck Goes Here         34.0         2.99          0.55           USD

### Challenge: first combine these sales together into a single dataframe, then compute how much money consumers spent on each book in each currency.
- first table is in USD
- second table actually consists of 3 smaller tables. First 9 rows are for USD, next 8 rows are for GBP and final 7 are for EUR.

In [17]:
# Merge and join didn't work
sales_t = pd.concat([sales1,sales2]).fillna(0) # replacing all values 
sales_t.head(10)

,Book title,Number sold,Sales price,Royalty paid,currency_type,Title,Units sold,List price,Royalty
0,The Bricklayer’s Bible,8.0,2.99,0.55,USD,0,0.0,0.00,0.00
1,Swimrand,2.0,1.99,0.35,USD,0,0.0,0.00,0.00
2,Pining For The Fisheries of Yore,28.0,2.99,0.55,USD,0,0.0,0.00,0.00
3,The Duck Goes Here,34.0,2.99,0.55,USD,0,0.0,0.00,0.00
4,The Tower Commission Report,4.0,11.50,4.25,USD,0,0.0,0.00,0.00
0,0,0.0,0.00,0.00,USD,0,0.0,0.00,0.00
1,0,0.0,0.00,0.00,USD,Sales report for Q4,0.0,0.00,0.00
2,0,0.0,0.00,0.00,USD,E-Book Reader US Store,0.0,0.00,0.00
3,0,0.0,0.00,0.00,USD,Pining for the Fisheries of Yore,80.0,3.50,14.98
4,0,0.0,0.00,0.00,USD,Swimrand,1.0,2.99,0.14

In [18]:
sales_t.iloc[0]

Book title       The Bricklayer’s Bible
Number sold                           8
Sales price                        2.99
Royalty paid                       0.55
currency_type                       USD
Title                                 0
Units sold                            0
List price                            0
Royalty                               0
Name: 0, dtype: object

In [19]:
sales_t.iloc[0][1] #interesting we have to only use index vals

8.0

In [20]:
test = sales_t['currency_type']

def change_rate(desired_currency,current_currency):
    '''ensure it is all in caps'''
    currency_exchage_rates= {
    'EUR_to_EUR':1,
    'EUR_to_USD':1.17,
    'EUR_to_GBP':.97,
    'USD_to_USD':1,
    'USD_to_EUR':.86,
    'USD_to_GBP':.78,
    'GBP_to_GBP':1,
    'GBP_to_EUR':1.10,
    'GBP_to_USD':1.29
}
    to_from_key = str(desired_currency) + '_to_' + str(current_currency)
    change_rate = currency_exchage_rates.get(to_from_key,0)
    return(change_rate)

In [21]:
print(change_rate('EUR','USD'))

1.17

In [22]:
if sales_t.iloc[11]['Book title']:
    print(1)

In [24]:
total_amount = 0
desired_currency = 'EUR'
for row in range(len(sales_t)):
    
    currency = sales_t.iloc[row][4]
    modifier = change_rate(desired_currency,currency)    
    if sales_t.iloc[row]['Book title']:
        print(f'sales1:{row}')
        print(f'units sold: {sales_t.iloc[row][1]} price per unit: {sales_t.iloc[row][2]} royalty paid:  {sales_t.iloc[row][3]} currency type: {sales_t.iloc[row][4]}')
        total_amount += (sales_t.iloc[row][1] * sales_t.iloc[row][2]*modifier) + (sales_t.iloc[row][3]*modifier)
    else:
        print(f'sales2:{row}')
        print(f'units sold: {sales_t.iloc[row][6]} price per unit: {sales_t.iloc[row][7]} royalty paid:  {sales_t.iloc[row][8]} currency type: {sales_t.iloc[row][4]}')
        
        total_amount += (sales_t.iloc[row][6] * (sales_t.iloc[row][7]*modifier)) + (sales_t.iloc[row][8]*modifier)

total_amount

sales1:0
units sold: 8.0 price per unit: 2.99 royalty paid:  0.55 currency type: USD
sales1:1
units sold: 2.0 price per unit: 1.99 royalty paid:  0.35 currency type: USD
sales1:2
units sold: 28.0 price per unit: 2.99 royalty paid:  0.55 currency type: USD
sales1:3
units sold: 34.0 price per unit: 2.99 royalty paid:  0.55 currency type: USD
sales1:4
units sold: 4.0 price per unit: 11.5 royalty paid:  4.25 currency type: USD
sales2:5
units sold: 0.0 price per unit: 0.0 royalty paid:  0.0 currency type: USD
sales2:6
units sold: 0.0 price per unit: 0.0 royalty paid:  0.0 currency type: USD
sales2:7
units sold: 0.0 price per unit: 0.0 royalty paid:  0.0 currency type: USD
sales2:8
units sold: 80.0 price per unit: 3.5 royalty paid:  14.98 currency type: USD
sales2:9
units sold: 1.0 price per unit: 2.99 royalty paid:  0.14 currency type: USD
sales2:10
units sold: 17.0 price per unit: 3.5 royalty paid:  5.15 currency type: USD
sales2:11
units sold: 34.0 price per unit: 2.99 royalty paid:  5.78 currency type: USD
sales2:12
units sold: 4.0 price per unit: 9.5 royalty paid:  6.2 currency type: USD
sales2:13
units sold: 0.0 price per unit: 0.0 royalty paid:  32.25 currency type: USD
sales2:14
units sold: 0.0 price per unit: 0.0 royalty paid:  0.0 currency type: GBP
sales2:15
units sold: 0.0 price per unit: 0.0 royalty paid:  0.0 currency type: GBP
sales2:16
units sold: 0.0 price per unit: 0.0 royalty paid:  0.0 currency type: GBP
sales2:17
units sold: 0.0 price per unit: 0.0 royalty paid:  0.0 currency type: GBP
sales2:18
units sold: 47.0 price per unit: 2.99 royalty paid:  11.98 currency type: GBP
sales2:19
units sold: 17.0 price per unit: 2.99 royalty paid:  3.5 currency type: GBP
sales2:20
units sold: 4.0 price per unit: 6.5 royalty paid:  4.8 currency type: GBP
sales2:21
units sold: 0.0 price per unit: 0.0 royalty paid:  20.28 currency type: GBP
sales2:22
units sold: 0.0 price per unit: 0.0 royalty paid:  0.0 currency type: EUR
sales2:23
units sold: 0.0 price per unit: 0.0 royalty paid:  0.0 currency type: EUR
sales2:24
units sold: 0.0 price per unit: 0.0 royalty paid:  0.0 currency type: EUR
sales2:25
units sold: 0.0 price per unit: 0.0 royalty paid:  0.0 currency type: EUR
sales2:26
units sold: 8.0 price per unit: 1.99 royalty paid:  0.88 currency type: EUR
sales2:27
units sold: 12.0 price per unit: 1.99 royalty paid:  1.5 currency type: EUR
sales2:28
units sold: 0.0 price per unit: 0.0 royalty paid:  2.38 currency type: EUR

1244.9929999999997